# SystemType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipingSystem..::..SystemType Property
PipingSystem Class See Also
---
The type of this piping system.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PipeSystemType SystemType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SystemType As PipeSystemType
	Get
```

Visual C++
---
```text
public:
property PipeSystemType SystemType {
	PipeSystemType get ();
}
```

# See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace